{"data":{"root":{"post":{"body":"<p>I decided to take stock of the books that are sitting on my bookshelf for 2014.\nHere is that list.</p>\n<p>Starting with some (of my) classics. These are books that I read in the\nmiddle/high school time period in my life.</p>\n<h4 id=\"basic-technical-mathematics-with-calculus\"><a href=\"http://www.amazon.com/Basic-Technical-Mathematics-Calculus-Edition/dp/0133116530?tag=christophe067-20\">Basic Technical Mathematics with Calculus</a></h4>\n<p>(note: my version is the second edition. It looks like they’re up to the tenth)</p>\n<p>This was a book that let me explore math on my own. It goes from trig functions\nthrough linear equations, logarithms, determinants and matrices, derivatives,\nintegration, series expansion and differential equations. A little beyond what\nmy AP Calc class ended up taking us through. I would suggest it if you have an\ninterest in Mathematics and Calculus at an advanced high school level.</p>\n<h4 id=\"texas-instruments-ti-83-manual\">Texas Instruments TI-83+ Manual</h4>\n<p>I read this cover to cover one day. It led through the days of BASIC on a\ncalculator in Math class, where I would program equation solvers and games.</p>\n<h2 id=\"distributed-systems\">Distributed Systems</h2>\n<h4 id=\"distributed-systems-concepts-and-design\">Distributed Systems Concepts and Design</h4>\n<p>The purchase of this book was driven by my interest in Erlang and Riak Core. I\nwas hoping that this would give me some good information on distributed systems\nbut it’s a bit of a slog to parse the wordiness of the book. Preferable would be\nto surf the repos of various open source projects. The table of contents,\nhowever, is useful in pointing you to on the path to those projects.</p>\n<h4 id=\"parallel-and-concurrent-programming-in-haskell\"><a href=\"http://www.amazon.com/Parallel-Concurrent-Programming-Haskell-Multithreaded/dp/1449335942/?tag=christophe067-20\">Parallel and Concurrent Programming in Haskell</a></h4>\n<p>A solid book that takes you through parallelism and concurrency in Haskell with\nplenty of code to work with. Concepts covered include Data Parallel Programing,\nGPU programming, MVars, Software Transactional Memory and finally\ndistributed-process, which is an attempt to create a sort of Erlang-as-a-package\nfor Haskell.</p>\n<h2 id=\"databases\">Databases</h2>\n<h4 id=\"readings-in-database-systems\"><a href=\"http://www.amazon.com/Readings-Database-Systems-Joseph-Hellerstein/dp/0262693143?tag=christophe067-20\">Readings in Database Systems</a></h4>\n<p>Databases are not my specialty, so I use this book as some casual reading. It is\na collection of academic papers relating to databases.</p>\n<h2 id=\"lisp-lambda-calculus-and-functional-programming\">Lisp, Lambda Calculus and Functional Programming</h2>\n<h4 id=\"an-introduction-to-functional-programming-through-lambda-calculus\"><a href=\"http://www.amazon.com/Introduction-Functional-Programming-Calculus-Mathematics/dp/0486478831?tag=christophe067-20\">An Introduction to Functional Programming Through Lambda Calculus</a></h4>\n<p>This is a fun book that take you through the lambda calculus with a functional\nslant. Includes some comparisons with Lisp and Scheme later in the book.</p>\n<h4 id=\"pearls-of-functional-algorithm-design\"><a href=\"http://www.amazon.com/Pearls-Functional-Algorithm-Design-Richard/dp/0521513383?tag=christophe067-20\">Pearls of Functional Algorithm Design</a></h4>\n<p>A nice look at functional algorithms with plenty of Haskell code. I quite enjoy\nthis book when I’m in an algorithmic mood.</p>\n<h4 id=\"common-lisp\"><a href=\"http://www.cs.cmu.edu/~dst/LispBook/\">Common Lisp</a></h4>\n<p>Widely recognized as a great introduction to the Common Lisp language. I don’t\nwrite as much Lisp as I would like to, but having mocl around for\nexperimentation sure helps.</p>\n<h4 id=\"let-over-lambda\"><a href=\"http://letoverlambda.com/\">Let Over Lambda</a></h4>\n<p>Let Over Lambda is billed as a book about macros, in other words a book to move\nyou from intermediate lisper to professional. I’d like to spend a little more\ntime with Common Lisp over the next year and Let Over Lambda will be one of the\nbooks I use to do that.</p>\n<h2 id=\"training\">Training</h2>\n<p>For those that don’t know, I train for Volleyball and High Jump. Having played\nDivision 1 Volleyball in college I still enjoy training and competing at a high\nlevel. These books help me move towards my athletic goals.</p>\n<h4 id=\"weightlifting-programming-a-winning-coachs-guide\"><a href=\"http://www.amazon.com/Weightlifting-Programming-Winning-Coachs-Guide/dp/0980011159?tag=christophe067-20\">Weightlifting Programming: A Winning Coach’s Guide</a></h4>\n<p>This is a book by a well respected coach in the weightlifting community. Since I\nuse Olympic lifts in my training this will help me program my lifting workouts\nfor greater effect.</p>\n<h4 id=\"overcoming-gravity\"><a href=\"http://www.amazon.com/Overcoming-Gravity-Systematic-Gymnastics-Bodyweight/dp/1467933120?tag=christophe067-20\">Overcoming Gravity</a></h4>\n<p>I’m not a huge fan of doing bench press, bicep curls, etc. So I got this book\nabout training gymnastics movements to supplement my Olympic lifting, especially\nmy upper body which I don’t need excess hypertrophy on.</p>\n<h4 id=\"abs-on-the-ball-a-pilates-approach-to-building-superb-abdominals\"><a href=\"http://www.amazon.com/Abs-Ball-Approach-Building-Abdominals/dp/089281098X?tag=christophe067-20\">Abs on the Ball: A Pilates Approach to Building Superb Abdominals</a></h4>\n<p>In the past I’ve found Pilates on exercise balls to be a great way to improve\ncore strength and stability. Colleen Craig’s books have been on my shelf for\nawhile and I often take exercises from them. Core strength will help me in my\nlifts, gymnastics training and controlling my body in the air while jumping for\nHigh Jump and Volleyball.</p>\n<h4 id=\"becoming-a-supple-leopard-the-ultimate-guide-to-resolving-pain-preventing-injury-and-optimizing-athletic-performance\"><a href=\"http://www.amazon.com/Becoming-Supple-Leopard-Preventing-Performance/dp/1936608588?tag=christophe067-20\">Becoming a Supple Leopard: The Ultimate Guide to Resolving Pain, Preventing Injury, and Optimizing Athletic Performance</a></h4>\n<p>This is a book I use for preventative maintenance of joints and muscles. I went\nto an arthritis specialist in college who told me that my joints were\nhypermobile, which means that I can do things like dislocate my shoulder or\nthose weird thumb/finger tricks you may have seen people do, all over my body.\nPreventative maintenance is therefore particularly important in my mind.</p>\n<h2 id=\"other\">Other</h2>\n<p>The final book on my shelf for 2014 is Sartre’s L’existentialisme est un\nhumanisme in the original French.</p>\n","attributes":{"title":"Books on My Bookshelf for 2014","updatedAt":"Jan 8th, 2014","publishedAt":"Jan 8th, 2014","timeToRead":3,"headerImage":null,"url":"/2014/1/7/books-on-my-bookshelf-for-2014/","canonicalURL":null,"excerpt":"I decided to take stock of the books that are sitting on my bookshelf for 2014.\nHere is that list.","__typename":"BlogPostAttributes"},"__typename":"BlogPost"},"__typename":"Query"}}}